{
  "activation_dropout": 0.0,
  "activation_function": "gelu",
  "add_type_embedding": true,
  "architectures": [
    "OFAModel"
  ],
  "attention_dropout": 0.0,
  "attn_scale_factor": 2.0,
  "bos_token_id": 0,
  "classifier_dropout": 0.0,
  "code_image_size": 128,
  "code_layernorm_embedding": true,
  "d_model": 1024,
  "decoder_attention_heads": 16,
  "decoder_drop_path_rate": 0.0,
  "decoder_ffn_dim": 4096,
  "decoder_layerdrop": 0.0,
  "decoder_layers": 12,
  "decoder_normalize_before": true,
  "decoder_start_token_id": 0,
  "dropout": 0.1,
  "encoder_attention_heads": 16,
  "encoder_drop_path_rate": 0.0,
  "encoder_ffn_dim": 4096,
  "encoder_layerdrop": 0.0,
  "encoder_layers": 12,
  "encoder_normalize_before": true,
  "entangle_position_embedding": false,
  "eos_token_id": 2,
  "forced_eos_token_id": 2,
  "image_bucket_size": 42,
  "init_std": 0.02,
  "is_encoder_decoder": true,
  "layernorm_embedding": true,
  "max_position_embeddings": 1024,
  "model_type": "ofa",
  "normformer": true,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "patch_layernorm_embedding": true,
  "resnet_drop_path_rate": 0.0,
  "resnet_model_path": null,
  "resnet_type": "resnet152",
  "scale_embedding": false,
  "share_decoder_input_output_embed": true,
  "token_bucket_size": 256,
  "torch_dtype": "float32",
  "transformers_version": "4.15.0",
  "use_cache": false,
  "vocab_size": 59457
}
